// todo Сортування масиву із циклом
/*
 * Використовуючи метод splice(), замініть у масиві, що складається з декількох рядкових
змінних, що складаються в одну речення, вказану користувачем слово.
Наприклад, у нас є такий масив: const poem = ["Мороз","и", "солнце", "день","чудесный"];
Вам необхідно запитати у користувача номер слова, яке потрібно видалити, а потім яке
слово потрібно замінити. Після цього потрібно вивести масив у вигляді цільної фрази із
пробілами, використовуючи метод join().

Примітка: Коли ви пропонуватимете користувачеві ввести номер слова від 1 до ...,
в кінці повинна стояти цифра, отримана з властивості length вашого масиву.
Якщо користувач введе менше 1 або більше довжини масиву, ви повинні видавати йому
попередження про те, що така дія неприпустима, і потрібно вводити число в певному діапазоні.
Зверніть увагу, що нумерація елементів в масиві починається з 0, а звичайні
користувачі вважають слова в реченні з 1.
 */

let poem = ['Мороз', 'и', 'солнце', 'день', 'чудесный'];
let index = null;

do {
  alert(poem.join(' '));
  index = prompt('Вкажіть індекс слова?');
  console.log('index :>> ', index);
  if (index) {
    const word = prompt('Вкажіть слово?');
    poem.splice(Number(index), 1, word);
  }
} while (index !== null);
