// todo Дедлайн здачі проекту (if...else)
/*
 * Напиши скрипт для відображення часу дедлайну здачі проекту. Використовуй конструкцію if...else.

* Якщо до дедлайну 0 днів - виведи рядок "Сьогодні"
* Якщо до дедлайну 1 день - виведи рядок "Завтра"
* Якщо до дедлайну 2 дні - виведи рядок "Післязавтра"
* Якщо до дедлайну 3+ днів - виведи рядок "Дата в майбутньому"
 */

const daysUntilDeadline = 2;
let message;

if (daysUntilDeadline === 0) {
  console.log('Сьогодні');
} else if (daysUntilDeadline === 1) {
  console.log('Завтра');
} else if (daysUntilDeadline === 2) {
  console.log('Післязавтра');
} else {
  console.log('Дата в майбутньому');
}
