//todo Сховище

/*
 * Напиши клас Storage, який створює об'єкти для управління складом товарів. При виклику отримуватиме один аргумент - початковий масив товарів, і записуватиме його у властивість items.

* Додай методи класу:

* getItems() - повертає масив товарів.
* addItem(item) - отримує новий товар та додає його до поточних.
* removeItem(item) - отримує товар і, якщо є, видаляє його з поточних.
 */

class Storage {}

// const storage = new Storage(['🍎', '🍋', '🍇', '🍑']);

// storage.addItem('🍌');
// storage.removeItem('🍋');
// storage.removeItem('🔆');
