// todo Розгалуження
/*
 * Напиши скрипт, який виводить у консоль рядок "Це позитивне число", якщо в prompt користувач ввів число більше за нуль. Якщо було введено нуль, виводь у консоль рядок "Це нуль". Якщо передали від'ємне число, у консолі має бути рядок "Це від'ємне число".
 */

const userInput = Number(prompt('Введіть число', 0));

if (userInput === 0) {
  console.log('Це нуль');
} else if (userInput > 0) {
  console.log('Це позитивне число');
} else {
  console.log("Це від'ємне число");
}
