/*
* Створити функцію getData, яка приймає два колбеки на випадок успішного виконання завдання (`Мі це зробили, Біллі - ${msg}`) та на випадок помилки (`Кеп, у нас проблема - ${err}`).
 * Завдання повинно випадково виконуватися із затримкою в 1 секунду.
 * Якщо успішно -  передати в колбек '✅ СУПЕР!', якщо ні - '❌ ПОМИЛКА!'

* Переписати на Promise (спочатку з двома колбеками в then, потім з catch)
 * При будь-якому результаті в кінці виводити '🚀 Finished!
*/

const isSuccess = Math.random() < 0.5; // Рандомна умова для виконання завдання
