// todo Введення користувача та розгалуження
/*
 * Напиши скрипт, який питатиме логін за допомогою prompt і логуватиме результат у консоль браузера.

* Якщо відвідувач вводить "Адмін", то prompt запитує пароль

* Якщо нічого не введено або натиснута клавіша Esc - вивести рядок "Скасовано"

* В іншому випадку вивести рядок "Я вас не знаю"
* Пароль перевіряти так:

* Якщо введено пароль "Я адмін", то вивести рядок "Вітаю!!"
* Інакше виводити рядок "Невірний пароль"
*/

const login = prompt('Ведіть логин!');
const LOGIN = 'адмін';
const PASSWORD = '123';

let message = '';
if (login) {
  if (login === LOGIN) {
    const password = prompt('Ведіть пароль!');
    if (password) {
      if (password === PASSWORD) {
        message = 'Вітаю!!';
      } else {
        message = 'Невірний пароль';
      }
    } else {
      message = 'Скасовано';
    }
  } else {
    message = 'Я вас не знаю';
  }
} else {
  message = 'Скасовано';
}

console.log('pas :>> ', message);
